app/Helpers/Carousal_helper.php

    function render_carousal_by_code(string $code): string
    {
        $model = new CarousalModel();
        $images = $model->where('code', $code)->where('status', 1)->findAll();
---
SELECT *
FROM `carousals`
WHERE `code` = 'harish_test'
AND `status` = 1